<template>
   <div>
    <title-section title="أعمالنا" subTitle1="أعمالنا" subTitle2="/أعمال البرمجيات" subTitle1Link="/projects" />

        <div class="mt-[300px] space-y-20 md:w-[80%] md:mx-auto mx-2 animated wow fadeInRight "

        data-wow-duration="1.3s"
        data-wow-delay="0s">
        <h2 class="text-3xl font-semibold">
            أعمال البرمجيات
        </h2>
        <template >
            <our-projects-card   v-for="(item, index) in items" 
  :key="index" 
  :item="item" 
  />
        </template>
        </div>
   </div>
  </template>
  
  <script setup>
  const items = [
      {
          title: "CoffeeKies",
          image: "/coffee.png",
          desc: "في موقعنا، نقدم لك تجربة فريدة تجمع بين عشق القهوة وأطيب أنواع الكيك. من الحبوب المحمصة بعناية إلى وصفات الكيك المصنوعة بكل حب – كل طلبية تُحضَّر لتضفي لحظة سعادة على يومك.",
          slug: "coffeekies"
      },
      {
          title: "متجر مبادرات الخير",
          image: "/p3.jpg",
          desc: "مبادرات الخير هي منصتك المتكاملة لإنشاء وإدارة متجرك الإلكتروني بسهولة واحترافية، دون الحاجة لأي خبرة تقنية. ممت خصيصًا لدعم رواد الأعمال والمبادرين، وتجمع بين أدوات التجارة الإلكترونية الذكية وروح العطاء، لتمنحك تجربة فريدة في عالم التجارة الرقمية.",
          slug: "mubadrat"
      },
      {
          title: "Study Pedia",
          image: "/study.jpeg",
          desc: "Studypedia هو تطبيق مبتكر يتيح لك إنشاء ومتابعة الكورسات التعليمية بسهولة من أي مكان وفي أي وقت. سواء كنت معلّمًا تطمح لنشر علمك، أو متعلمًا يبحث عن تطوير مهاراته، Studypedia يجمع لك كل ما تحتاجه في منصة واحدة",
          slug: "studypedia"
      },
    //   {
    //       title: "تطبيق واو الترفيهي",
    //       image: "/wow.png",
    //       desc: "هذا النص هو مثال لنص يمكن تغييره هي نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة ها النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة",
    //       slug: "wow"
    //   },
    //   {
    //       title: "موقع قدرات طيبة",
    //       image: "/medical.png",
    //       desc: "هذا النص هو مثال لنص يمكن تغييره هي نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة ها النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة هذا النص هو مثال لنص يمكن تغييره في نفس المساحة",
    //       slug: "medical"
    //   },
  ]
  </script>
  